###################################################################

# Created by write_sdc on Thu Apr 16 20:58:48 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_driving_cell -lib_cell INVD0 [get_ports clk]
set_driving_cell -lib_cell INVD0 [get_ports rst_n]
set_driving_cell -lib_cell INVD0 [get_ports start]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[15]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[14]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[13]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[12]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[11]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[10]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[9]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[8]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[7]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[6]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[5]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[4]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[3]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[2]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[1]}]
set_driving_cell -lib_cell INVD0 [get_ports {data_in_re[0]}]
set_driving_cell -lib_cell INVD0 [get_ports tb_io_mode]
set_driving_cell -lib_cell INVD0 [get_ports tb_skip_load]
set_driving_cell -lib_cell INVD0 [get_ports tb_sram_we]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_addr[9]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_addr[8]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_addr[7]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_addr[6]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_addr[5]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_addr[4]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_addr[3]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_addr[2]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_addr[1]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_addr[0]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[31]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[30]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[29]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[28]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[27]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[26]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[25]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[24]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[23]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[22]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[21]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[20]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[19]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[18]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[17]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[16]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[15]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[14]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[13]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[12]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[11]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[10]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[9]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[8]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[7]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[6]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[5]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[4]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[3]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[2]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[1]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_sram_din[0]}]
set_driving_cell -lib_cell INVD0 [get_ports tb_twiddle_we]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_addr[8]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_addr[7]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_addr[6]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_addr[5]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_addr[4]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_addr[3]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_addr[2]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_addr[1]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_addr[0]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[31]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[30]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[29]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[28]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[27]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[26]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[25]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[24]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[23]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[22]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[21]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[20]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[19]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[18]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[17]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[16]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[15]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[14]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[13]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[12]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[11]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[10]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[9]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[8]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[7]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[6]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[5]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[4]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[3]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[2]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[1]}]
set_driving_cell -lib_cell INVD0 [get_ports {tb_twiddle_din[0]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[31]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[30]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[29]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[28]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[27]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[26]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[25]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[24]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[23]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[22]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[21]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[20]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[19]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[18]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[17]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[16]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[15]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[14]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[13]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[12]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[11]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[10]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[9]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[8]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[7]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[6]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[5]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[4]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[3]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[2]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[1]}]
set_load -pin_load 0.004 [get_ports {tb_sram_dout[0]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[31]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[30]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[29]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[28]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[27]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[26]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[25]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[24]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[23]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[22]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[21]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[20]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[19]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[18]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[17]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[16]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[15]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[14]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[13]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[12]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[11]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[10]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[9]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[8]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[7]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[6]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[5]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[4]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[3]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[2]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[1]}]
set_load -pin_load 0.004 [get_ports {tb_twiddle_dout[0]}]
set_load -pin_load 0.004 [get_ports {data_out_re[15]}]
set_load -pin_load 0.004 [get_ports {data_out_re[14]}]
set_load -pin_load 0.004 [get_ports {data_out_re[13]}]
set_load -pin_load 0.004 [get_ports {data_out_re[12]}]
set_load -pin_load 0.004 [get_ports {data_out_re[11]}]
set_load -pin_load 0.004 [get_ports {data_out_re[10]}]
set_load -pin_load 0.004 [get_ports {data_out_re[9]}]
set_load -pin_load 0.004 [get_ports {data_out_re[8]}]
set_load -pin_load 0.004 [get_ports {data_out_re[7]}]
set_load -pin_load 0.004 [get_ports {data_out_re[6]}]
set_load -pin_load 0.004 [get_ports {data_out_re[5]}]
set_load -pin_load 0.004 [get_ports {data_out_re[4]}]
set_load -pin_load 0.004 [get_ports {data_out_re[3]}]
set_load -pin_load 0.004 [get_ports {data_out_re[2]}]
set_load -pin_load 0.004 [get_ports {data_out_re[1]}]
set_load -pin_load 0.004 [get_ports {data_out_re[0]}]
set_load -pin_load 0.004 [get_ports {data_out_im[15]}]
set_load -pin_load 0.004 [get_ports {data_out_im[14]}]
set_load -pin_load 0.004 [get_ports {data_out_im[13]}]
set_load -pin_load 0.004 [get_ports {data_out_im[12]}]
set_load -pin_load 0.004 [get_ports {data_out_im[11]}]
set_load -pin_load 0.004 [get_ports {data_out_im[10]}]
set_load -pin_load 0.004 [get_ports {data_out_im[9]}]
set_load -pin_load 0.004 [get_ports {data_out_im[8]}]
set_load -pin_load 0.004 [get_ports {data_out_im[7]}]
set_load -pin_load 0.004 [get_ports {data_out_im[6]}]
set_load -pin_load 0.004 [get_ports {data_out_im[5]}]
set_load -pin_load 0.004 [get_ports {data_out_im[4]}]
set_load -pin_load 0.004 [get_ports {data_out_im[3]}]
set_load -pin_load 0.004 [get_ports {data_out_im[2]}]
set_load -pin_load 0.004 [get_ports {data_out_im[1]}]
set_load -pin_load 0.004 [get_ports {data_out_im[0]}]
set_load -pin_load 0.004 [get_ports data_out_valid]
set_load -pin_load 0.004 [get_ports done]
set_load -pin_load 0.004 [get_ports {dbg_stage[3]}]
set_load -pin_load 0.004 [get_ports {dbg_stage[2]}]
set_load -pin_load 0.004 [get_ports {dbg_stage[1]}]
set_load -pin_load 0.004 [get_ports {dbg_stage[0]}]
set_load -pin_load 0.004 [get_ports dbg_stage_done]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports rst_n]
set_max_capacitance 0.005 [get_ports start]
set_max_capacitance 0.005 [get_ports {data_in_re[15]}]
set_max_capacitance 0.005 [get_ports {data_in_re[14]}]
set_max_capacitance 0.005 [get_ports {data_in_re[13]}]
set_max_capacitance 0.005 [get_ports {data_in_re[12]}]
set_max_capacitance 0.005 [get_ports {data_in_re[11]}]
set_max_capacitance 0.005 [get_ports {data_in_re[10]}]
set_max_capacitance 0.005 [get_ports {data_in_re[9]}]
set_max_capacitance 0.005 [get_ports {data_in_re[8]}]
set_max_capacitance 0.005 [get_ports {data_in_re[7]}]
set_max_capacitance 0.005 [get_ports {data_in_re[6]}]
set_max_capacitance 0.005 [get_ports {data_in_re[5]}]
set_max_capacitance 0.005 [get_ports {data_in_re[4]}]
set_max_capacitance 0.005 [get_ports {data_in_re[3]}]
set_max_capacitance 0.005 [get_ports {data_in_re[2]}]
set_max_capacitance 0.005 [get_ports {data_in_re[1]}]
set_max_capacitance 0.005 [get_ports {data_in_re[0]}]
set_max_capacitance 0.005 [get_ports tb_io_mode]
set_max_capacitance 0.005 [get_ports tb_skip_load]
set_max_capacitance 0.005 [get_ports tb_sram_we]
set_max_capacitance 0.005 [get_ports {tb_sram_addr[9]}]
set_max_capacitance 0.005 [get_ports {tb_sram_addr[8]}]
set_max_capacitance 0.005 [get_ports {tb_sram_addr[7]}]
set_max_capacitance 0.005 [get_ports {tb_sram_addr[6]}]
set_max_capacitance 0.005 [get_ports {tb_sram_addr[5]}]
set_max_capacitance 0.005 [get_ports {tb_sram_addr[4]}]
set_max_capacitance 0.005 [get_ports {tb_sram_addr[3]}]
set_max_capacitance 0.005 [get_ports {tb_sram_addr[2]}]
set_max_capacitance 0.005 [get_ports {tb_sram_addr[1]}]
set_max_capacitance 0.005 [get_ports {tb_sram_addr[0]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[31]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[30]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[29]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[28]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[27]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[26]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[25]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[24]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[23]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[22]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[21]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[20]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[19]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[18]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[17]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[16]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[15]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[14]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[13]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[12]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[11]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[10]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[9]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[8]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[7]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[6]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[5]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[4]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[3]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[2]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[1]}]
set_max_capacitance 0.005 [get_ports {tb_sram_din[0]}]
set_max_capacitance 0.005 [get_ports tb_twiddle_we]
set_max_capacitance 0.005 [get_ports {tb_twiddle_addr[8]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_addr[7]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_addr[6]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_addr[5]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_addr[4]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_addr[3]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_addr[2]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_addr[1]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_addr[0]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[31]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[30]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[29]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[28]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[27]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[26]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[25]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[24]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[23]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[22]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[21]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[20]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[19]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[18]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[17]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[16]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[15]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[14]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[13]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[12]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[11]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[10]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[9]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[8]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[7]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[6]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[5]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[4]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[3]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[2]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[1]}]
set_max_capacitance 0.005 [get_ports {tb_twiddle_din[0]}]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports rst_n]
set_max_fanout 4 [get_ports start]
set_max_fanout 4 [get_ports {data_in_re[15]}]
set_max_fanout 4 [get_ports {data_in_re[14]}]
set_max_fanout 4 [get_ports {data_in_re[13]}]
set_max_fanout 4 [get_ports {data_in_re[12]}]
set_max_fanout 4 [get_ports {data_in_re[11]}]
set_max_fanout 4 [get_ports {data_in_re[10]}]
set_max_fanout 4 [get_ports {data_in_re[9]}]
set_max_fanout 4 [get_ports {data_in_re[8]}]
set_max_fanout 4 [get_ports {data_in_re[7]}]
set_max_fanout 4 [get_ports {data_in_re[6]}]
set_max_fanout 4 [get_ports {data_in_re[5]}]
set_max_fanout 4 [get_ports {data_in_re[4]}]
set_max_fanout 4 [get_ports {data_in_re[3]}]
set_max_fanout 4 [get_ports {data_in_re[2]}]
set_max_fanout 4 [get_ports {data_in_re[1]}]
set_max_fanout 4 [get_ports {data_in_re[0]}]
set_max_fanout 4 [get_ports tb_io_mode]
set_max_fanout 4 [get_ports tb_skip_load]
set_max_fanout 4 [get_ports tb_sram_we]
set_max_fanout 4 [get_ports {tb_sram_addr[9]}]
set_max_fanout 4 [get_ports {tb_sram_addr[8]}]
set_max_fanout 4 [get_ports {tb_sram_addr[7]}]
set_max_fanout 4 [get_ports {tb_sram_addr[6]}]
set_max_fanout 4 [get_ports {tb_sram_addr[5]}]
set_max_fanout 4 [get_ports {tb_sram_addr[4]}]
set_max_fanout 4 [get_ports {tb_sram_addr[3]}]
set_max_fanout 4 [get_ports {tb_sram_addr[2]}]
set_max_fanout 4 [get_ports {tb_sram_addr[1]}]
set_max_fanout 4 [get_ports {tb_sram_addr[0]}]
set_max_fanout 4 [get_ports {tb_sram_din[31]}]
set_max_fanout 4 [get_ports {tb_sram_din[30]}]
set_max_fanout 4 [get_ports {tb_sram_din[29]}]
set_max_fanout 4 [get_ports {tb_sram_din[28]}]
set_max_fanout 4 [get_ports {tb_sram_din[27]}]
set_max_fanout 4 [get_ports {tb_sram_din[26]}]
set_max_fanout 4 [get_ports {tb_sram_din[25]}]
set_max_fanout 4 [get_ports {tb_sram_din[24]}]
set_max_fanout 4 [get_ports {tb_sram_din[23]}]
set_max_fanout 4 [get_ports {tb_sram_din[22]}]
set_max_fanout 4 [get_ports {tb_sram_din[21]}]
set_max_fanout 4 [get_ports {tb_sram_din[20]}]
set_max_fanout 4 [get_ports {tb_sram_din[19]}]
set_max_fanout 4 [get_ports {tb_sram_din[18]}]
set_max_fanout 4 [get_ports {tb_sram_din[17]}]
set_max_fanout 4 [get_ports {tb_sram_din[16]}]
set_max_fanout 4 [get_ports {tb_sram_din[15]}]
set_max_fanout 4 [get_ports {tb_sram_din[14]}]
set_max_fanout 4 [get_ports {tb_sram_din[13]}]
set_max_fanout 4 [get_ports {tb_sram_din[12]}]
set_max_fanout 4 [get_ports {tb_sram_din[11]}]
set_max_fanout 4 [get_ports {tb_sram_din[10]}]
set_max_fanout 4 [get_ports {tb_sram_din[9]}]
set_max_fanout 4 [get_ports {tb_sram_din[8]}]
set_max_fanout 4 [get_ports {tb_sram_din[7]}]
set_max_fanout 4 [get_ports {tb_sram_din[6]}]
set_max_fanout 4 [get_ports {tb_sram_din[5]}]
set_max_fanout 4 [get_ports {tb_sram_din[4]}]
set_max_fanout 4 [get_ports {tb_sram_din[3]}]
set_max_fanout 4 [get_ports {tb_sram_din[2]}]
set_max_fanout 4 [get_ports {tb_sram_din[1]}]
set_max_fanout 4 [get_ports {tb_sram_din[0]}]
set_max_fanout 4 [get_ports tb_twiddle_we]
set_max_fanout 4 [get_ports {tb_twiddle_addr[8]}]
set_max_fanout 4 [get_ports {tb_twiddle_addr[7]}]
set_max_fanout 4 [get_ports {tb_twiddle_addr[6]}]
set_max_fanout 4 [get_ports {tb_twiddle_addr[5]}]
set_max_fanout 4 [get_ports {tb_twiddle_addr[4]}]
set_max_fanout 4 [get_ports {tb_twiddle_addr[3]}]
set_max_fanout 4 [get_ports {tb_twiddle_addr[2]}]
set_max_fanout 4 [get_ports {tb_twiddle_addr[1]}]
set_max_fanout 4 [get_ports {tb_twiddle_addr[0]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[31]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[30]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[29]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[28]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[27]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[26]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[25]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[24]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[23]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[22]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[21]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[20]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[19]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[18]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[17]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[16]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[15]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[14]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[13]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[12]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[11]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[10]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[9]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[8]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[7]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[6]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[5]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[4]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[3]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[2]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[1]}]
set_max_fanout 4 [get_ports {tb_twiddle_din[0]}]
# set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 4  -waveform {0 2}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.06 [get_clocks clk]
set_clock_transition -max -fall 0.06 [get_clocks clk]
set_clock_transition -min -rise 0.06 [get_clocks clk]
set_clock_transition -min -fall 0.06 [get_clocks clk]
set_input_delay -clock clk  0.02  [get_ports start]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[15]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[14]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[13]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[12]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[11]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[10]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[9]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[8]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[7]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[6]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[5]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[4]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[3]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[2]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[1]}]
set_input_delay -clock clk  0.02  [get_ports {data_in_re[0]}]
set_input_delay -clock clk  0.02  [get_ports tb_io_mode]
set_input_delay -clock clk  0.02  [get_ports tb_skip_load]
set_input_delay -clock clk  0.02  [get_ports tb_sram_we]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_addr[9]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_addr[8]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_addr[7]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_addr[6]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_addr[5]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_addr[4]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_addr[3]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_addr[2]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_addr[1]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_addr[0]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[31]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[30]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[29]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[28]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[27]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[26]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[25]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[24]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[23]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[22]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[21]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[20]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[19]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[18]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[17]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[16]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[15]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[14]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[13]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[12]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[11]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[10]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[9]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[8]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[7]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[6]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[5]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[4]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[3]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[2]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[1]}]
set_input_delay -clock clk  0.02  [get_ports {tb_sram_din[0]}]
set_input_delay -clock clk  0.02  [get_ports tb_twiddle_we]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_addr[8]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_addr[7]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_addr[6]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_addr[5]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_addr[4]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_addr[3]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_addr[2]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_addr[1]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_addr[0]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[31]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[30]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[29]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[28]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[27]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[26]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[25]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[24]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[23]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[22]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[21]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[20]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[19]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[18]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[17]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[16]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[15]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[14]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[13]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[12]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[11]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[10]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[9]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[8]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[7]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[6]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[5]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[4]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[3]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[2]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[1]}]
set_input_delay -clock clk  0.02  [get_ports {tb_twiddle_din[0]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[31]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[30]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[29]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[28]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[27]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[26]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[25]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[24]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[23]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[22]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[21]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[20]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[19]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[18]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[17]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[16]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[15]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[14]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[13]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[12]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[11]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[10]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[9]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[8]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[7]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[6]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[5]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[4]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[3]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[2]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[1]}]
set_output_delay -clock clk  0.02  [get_ports {tb_sram_dout[0]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[31]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[30]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[29]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[28]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[27]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[26]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[25]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[24]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[23]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[22]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[21]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[20]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[19]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[18]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[17]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[16]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[15]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[14]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[13]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[12]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[11]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[10]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[9]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[8]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[7]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[6]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[5]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[4]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[3]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[2]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[1]}]
set_output_delay -clock clk  0.02  [get_ports {tb_twiddle_dout[0]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[15]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[14]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[13]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[12]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[11]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[10]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[9]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[8]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[7]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[6]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[5]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[4]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[3]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[2]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[1]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_re[0]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[15]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[14]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[13]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[12]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[11]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[10]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[9]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[8]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[7]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[6]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[5]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[4]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[3]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[2]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[1]}]
set_output_delay -clock clk  0.02  [get_ports {data_out_im[0]}]
set_output_delay -clock clk  0.02  [get_ports data_out_valid]
set_output_delay -clock clk  0.02  [get_ports done]
set_output_delay -clock clk  0.02  [get_ports {dbg_stage[3]}]
set_output_delay -clock clk  0.02  [get_ports {dbg_stage[2]}]
set_output_delay -clock clk  0.02  [get_ports {dbg_stage[1]}]
set_output_delay -clock clk  0.02  [get_ports {dbg_stage[0]}]
set_output_delay -clock clk  0.02  [get_ports dbg_stage_done]
